{
  "filename": "SDE-normal.pdf",
  "uploaded_at": "2025-11-19T16:35:27.258095",
  "role": "SDE",
  "company": "",
  "text": "Sankalp Gupta\n# guptasankalp2004@gmail.com (cid:132) +91 9314635933 (cid:240) sankalp Gupta § Sankalpgupta0\nSummary\nFull-stackdeveloperandMLenthusiastwithhands-onexperienceinbuildingscalablewebapps,real-timesystems,\nand AI-driven solutions. Skilled in MERN, Django, cloud deployment, and deep learning, with strong problem-\nsolving and team collaboration abilities.\nEducation\nLNM Institute of Information Technology 2022 – 2026\nB.Tech in Communication and Computer Engineering CGPA: 6.24/10\nChildren’s Academy 2020 – 2022\n12th in PCM Percentage: 92%\nExperience\nFull Stack Intern Dec 2024 – Apr 2025\nKoshpal Fintect Management LLP LOR 2 COI 2\n◦ Built and optimized React Native components, improving app responsiveness and reducing load times by\n25\n◦ Developed and integrated secure REST APIs (Node.js/Express.js + MongoDB) to handle UPI transactions\nwith high reliability.\n◦ Implemented data visualization and real-time financial features, enhancing user engagement and boosting\nretention.\nFull Stack Intern Jul 2024 – sep 2024\nAtiUttam LOR 2 COI 2\n◦ Built and deployed a trading insights web app with real-time indices and crypto candle updates, enabling\n1000+ concurrent users.\n◦ Implemented authentication, profile management, and watchlists, improving user retention.\n◦ Deployed on Azure with CI/CD and Git, ensuring 99% uptime and secure access.\nProjects\nVideo Hosting Website and Mobile App github 2 link 2\n◦ Engineered a YouTube-like video hosting platform with 100K+ lines of code, featuring seamless cross-\nplatform (web + mobile) support.\n◦ ImplementedsImplementedsocialinteractionmodules(likes,dislikes,comments,subscriptions)thatboosted\nuser engagement and retention.\n◦ Optimizedvideodeliverypipeline, reducingloadtimeby40%throughRediscachingandAPIratelimiting,\nenhancing scalability and performance.\n◦ Technologies Used: Express, React, React Native, MongoDB, Cloudinary, Redis, Docker, WebSockets.\nReal-Time Chat Application Client 2 Server 2 link 2\n◦ Developed a WhatsApp-style chat application supporting real-time messaging, media sharing, and video\ncalls across platforms.\n◦ Integrated advanced features like image/video/PDF sharing and real-time notifications, significantly en-\nhancing user experience.\n◦ Achieved sub-200ms message delivery latency using WebSockets with Socket.IO for high responsiveness.\n◦ Technologies Used: Express, React, MongoDB, Cloudinary, Socket.io.\nAchievements\nSheher Connect – Reputation-Driven News Platform github 2\n◦ Designed a reputation-driven scoring system for validating news, improving prototype trust levels by 70\n◦ Built a decentralized news platform with credibility checks to combat misinformation in citizen journalism.\n◦ Secured 3rd place in the hackathon , competing against 80+teams.\nSkills\n◦ Programming: Java, Python, JavaScript.\n◦ Tools & Platforms: AWS, Git, Github Expo, Vite, Render, Redis, Docker, Postman, Clerk, Appwrite,\nFirebase.\n◦ Frameworks:React, Node.js, Django, Flask, Vue.\n◦ Databases:MongoDB, Redis, Postgress.\n◦ ML/AI:Deep Learning, NLP, Transformers.\n",
  "analysis": {
    "summary": "Sankalp is a full-stack developer and ML enthusiast with experience building scalable web applications and AI-driven solutions. He possesses a strong foundation in MERN stack, Django, cloud deployment, and deep learning, complemented by problem-solving and teamwork skills.",
    "strengths": [
      "Full-stack development experience (React, Node.js, Express.js, MongoDB)",
      "Experience with cloud deployment (Azure, AWS, Render)",
      "Experience with real-time systems (WebSockets, Socket.IO)",
      "Project experience demonstrating scalability and performance optimization (Redis caching, API rate limiting)",
      "Experience with mobile development (React Native)",
      "Experience with databases (MongoDB, Redis, Postgres)",
      "Experience with CI/CD and Git",
      "ML/AI knowledge (Deep Learning, NLP, Transformers)",
      "Experience with authentication and authorization (Clerk, Appwrite, Firebase)"
    ],
    "shortcomings": [
      "CGPA is relatively low (6.24/10)",
      "Limited details on the specific deep learning projects or applications",
      "Lack of quantifiable achievements in the 'Achievements' section beyond the hackathon placement. The 70% improvement in prototype trust levels needs more context.",
      "The resume uses non-standard symbols (cid, §) which should be avoided for readability and parsing by applicant tracking systems (ATS)."
    ],
    "recommended_companies": [
      "Startups focused on real-time applications (e.g., chat, trading platforms)",
      "Companies using MERN stack for web development",
      "Companies involved in AI/ML projects, particularly those leveraging cloud infrastructure",
      "Companies with a strong emphasis on full-stack development and rapid prototyping"
    ],
    "selection_chance": "75%",
    "selection_reasoning": "Sankalp's resume showcases a solid foundation in full-stack development with practical experience in building web and mobile applications. His projects demonstrate his ability to handle scalability, real-time features, and cloud deployment. The internships provide relevant industry experience. The relatively low CGPA is a minor concern, but the strong project portfolio and internship experience compensate for it. The selection chance is high because he has a good mix of skills and experience that are relevant to many SDE positions. The chance isn't higher because of the CGPA and the need for more details on ML projects.",
    "recommendations": [
      "Quantify achievements whenever possible. Instead of saying 'improved app responsiveness,' provide specific metrics (e.g., 'reduced app load time by 25%').",
      "Elaborate on the ML/AI projects. Provide details on the specific models used, datasets, and results achieved.",
      "Provide links to the projects on GitHub or other platforms to allow recruiters to review the code.",
      "Tailor the resume to each specific job application, highlighting the skills and experiences that are most relevant to the role.",
      "Consider adding a 'Skills' section that is more granular and specific, listing individual technologies and tools.",
      "Replace the non-standard symbols with standard characters for better readability and ATS compatibility.",
      "Consider adding a 'Technical Skills' section and a 'Soft Skills' section to better highlight both aspects of his skillset."
    ]
  }
}